import { Typography } from 'antd';

const { Title, Paragraph } = Typography;

export function Respon() {
  return (
    <>
      <Title level={2}>免责申明</Title>

      <Paragraph>
        <Title level={5}>一、协议概述</Title>
        <p>
          本软件免责声明协议（以下简称“本协议”）是由【上海信新实界企业发展有限公司】（以下简称“本软件”）开发的，并提供（以下简称“开发者”）给用户（以下简称“用户”）使用的软件，该软件的使用、维护及相关责任和义务所达成的一项协议。用户在使用本软件之前，必须仔细阅读并同意本协议的全部内容。若用户不同意本协议的任何条款，请勿使用本软件。
        </p>
        <Title level={5}>二、软件许可</Title>
        <p>
          1.
          开发者授予用户非排他性、不可转让、不可转售的有限许可，使用本软件及其附带文档。
        </p>
        <p>
          2.
          用户仅可按照本协议规定的方式使用本软件，不得对本软件进行修改、复制、出租、出售、散布、倒卖或用于任何非法用途。
        </p>
        <p>
          3.
          用户在使用本软件时，应遵守国家有关法律法规，不得利用本软件从事违法活动。
        </p>
        <Title level={5}>三、免责声明</Title>
        <p>
          1. 本软件可能存在缺陷或错误，开发者不对因此导致的任何损失承担责任。
        </p>
        <p>
          2.
          用户在使用本软件过程中，因软件故障、网络问题、设备故障等原因导致的损失，开发者不承担责任。
        </p>
        <p>
          3.
          本软件提供的信息仅供参考，开发者不对用户根据本软件提供的信息所做出的决策承担责任。
        </p>
        <p>
          4.
          用户在使用本软件过程中，如违反国家法律法规或侵犯他人合法权益，开发者不承担责任。
        </p>
        <p>
          5.
          开发者不对因不可抗力因素（如自然灾害、政府行为、网络故障等）导致的本软件服务中断或数据丢失承担责任。
        </p>
        <p>
          6.
          本软件的更新、维护及升级由开发者自行决定，开发者不保证更新、维护及升级后软件的性能及兼容性。
        </p>
        <Title level={5}>四、知识产权</Title>
        <p>1. 本软件及其附带文档的知识产权归开发者所有。</p>
        <p>2. 用户不得侵犯开发者的知识产权，包括但不限于复制、修改、传播等。</p>
        <p>
          3.
          用户在使用本软件过程中，不得删除或修改本软件中的任何版权、商标、专利等知识产权标识。
        </p>
        <Title level={5}>五、隐私政策</Title>
        <p>
          1.
          开发者承诺，在用户使用本软件过程中，将严格遵守国家相关法律法规，保护用户的个人信息安全。
        </p>
        <p>2. 开发者未经用户同意，不将用户的个人信息用于任何商业用途。</p>
        <p>
          3.
          用户同意，开发者有权收集、使用、存储、处理和传输用户在使用本软件过程中产生的相关信息。
        </p>
        <Title level={5}>六、争议解决</Title>
        <p>1. 用户与本软件之间的任何争议，应首先通过友好协商解决。</p>
        <p>2. 如协商无果，双方同意将争议提交至有管辖权的人民法院诉讼解决。</p>
        <Title level={5}>七、其他</Title>
        <p>
          1. 本协议的签订、效力、解释、履行及争议解决均适用中华人民共和国法律。
        </p>
        <p>2. 本协议的任何条款，如因任何原因无效，不影响其他条款的效力。</p>
        <p>3. 本协议自用户点击“同意”按钮或下载、安装、使用本软件之日起生效。</p>
        <p>4. 本协议的最终解释权归开发者所有。</p>
        <p>用户在阅读并同意本协议后，方可使用本软件。</p>
      </Paragraph>
    </>
  );
}
